WheelerLee/esp32-ai-agent/components/LCD/lcd.c
#include "lcd.h"

#include <stdbool.h>
#include <stddef.h>
#include <stdio.h>
#include <string.h>

#include "app_wifi.h"
#include "audio.h"
#include "driver/spi_master.h"
#include "esp_check.h"
#include "esp_heap_caps.h"
#include "esp_idf_version.h"
#include "esp_lcd_ili9341.h"
#include "esp_lcd_panel_io.h"
#include "esp_lcd_panel_ops.h"
#include "esp_lcd_touch.h"
#include "esp_lcd_touch_xpt2046.h"
#include "esp_log.h"
#include "esp_spiffs.h"
#include "esp_timer.h"
#include "freertos/FreeRTOS.h"
#include "freertos/semphr.h"
#include "freertos/task.h"
#include "lazy_font.h"
#include "lvgl.h"

static const char *TAG = "lcd";

LV_FONT_DECLARE(lv_font_chinese_16);

static esp_lcd_panel_handle_t s_panel_handle;
static lv_disp_draw_buf_t s_disp_buf;
static lv_disp_drv_t s_disp_drv;
static lv_indev_drv_t s_indev_drv;
static lv_obj_t *s_wifi_status_label;
static lv_obj_t *s_wifi_list;
static lv_obj_t *s_password_ta;
static lv_obj_t *s_keyboard;
static esp_lcd_touch_handle_t s_touch_handle;
static SemaphoreHandle_t s_lvgl_mutex;
static TaskHandle_t s_lvgl_task_handle;
static const lv_font_t *s_external_chinese_font;
static app_wifi_ap_record_t s_scan_results[APP_WIFI_MAX_APS];
static size_t s_scan_count;
static char s_selected_ssid[APP_WIFI_SSID_MAX_LEN + 1];

static void show_home_page(void);
static void show_wifi_page(void);
static void show_wifi_connect_page(const char *ssid);
static void start_wifi_scan(void);
static void update_wifi_status_text(void);
static void lvgl_lock(void);
static void lvgl_unlock(void);

#define LCD_PLAY_URL "http://192.168.1.254:5500/music.mp3"
#define LCD_FONT_MOUNT_POINT "/font"
#define LCD_FONT_PARTITION_LABEL "font"
#define LCD_FONT_FILE_NAME "llm_text_14_lazy.bin"
#define LCD_FONT_PATH LCD_FONT_MOUNT_POINT "/" LCD_FONT_FILE_NAME

static const lv_font_t *ui_font(void)
{
  return s_external_chinese_font != NULL ? s_external_chinese_font : &lv_font_chinese_16;
}

static void load_external_font(void)
{
  esp_vfs_spiffs_conf_t conf = {
    .base_path = LCD_FONT_MOUNT_POINT,
    .partition_label = LCD_FONT_PARTITION_LABEL,
    .max_files = 2,
    .format_if_mount_failed = false,
  };

  esp_err_t err = esp_vfs_spiffs_register(&conf);
  if (err == ESP_ERR_INVALID_STATE) {
    err = ESP_OK;
  }

  if (err != ESP_OK) {
    ESP_LOGW(TAG, "mount font partition failed: %s", esp_err_to_name(err));
    return;
  }

  int64_t start_us = esp_timer_get_time();
  s_external_chinese_font = lazy_font_load(LCD_FONT_PATH, &lv_font_chinese_16);
  if (s_external_chinese_font == NULL) {
    ESP_LOGW(TAG, "load external font failed: %s", LCD_FONT_PATH);
  } else {
    ESP_LOGI(TAG,
             "loaded external font: %s in %lld ms",
             LCD_FONT_PATH,
             (long long)((esp_timer_get_time() - start_us) / 1000));
  }
}

static uint16_t clamp_u16(uint16_t value, uint16_t min_value, uint16_t max_value)
{
  if (value < min_value) {
    return min_value;
  }
  if (value > max_value) {
    return max_value;
  }
  return value;
}

static uint16_t map_touch_axis(uint16_t value,
                               uint16_t in_min,
                               uint16_t in_max,
                               uint16_t out_max)
{
  value = clamp_u16(value, in_min, in_max);
  return (uint32_t)(value - in_min) * out_max / (in_max - in_min);
}

static void touch_process_coordinates(esp_lcd_touch_handle_t tp,
                                      uint16_t *x,
                                      uint16_t *y,
                                      uint16_t *strength,
                                      uint8_t *point_num,
                                      uint8_t max_point_num)
{
  (void)tp;
  (void)strength;

  if (x == NULL || y == NULL || point_num == NULL) {
    return;
  }

  for (uint8_t i = 0; i < *point_num && i < max_point_num; ++i) {
    uint16_t raw_x = x[i];
    uint16_t raw_y = y[i];
    uint16_t mapped_x;
    uint16_t mapped_y;

    if (LCD_TOUCH_SWAP_XY) {
      mapped_x = map_touch_axis(raw_y, LCD_TOUCH_RAW_Y_MIN, LCD_TOUCH_RAW_Y_MAX, LCD_H_RES - 1);
      mapped_y = map_touch_axis(raw_x, LCD_TOUCH_RAW_X_MIN, LCD_TOUCH_RAW_X_MAX, LCD_V_RES - 1);
    } else {
      mapped_x = map_touch_axis(raw_x, LCD_TOUCH_RAW_X_MIN, LCD_TOUCH_RAW_X_MAX, LCD_H_RES - 1);
      mapped_y = map_touch_axis(raw_y, LCD_TOUCH_RAW_Y_MIN, LCD_TOUCH_RAW_Y_MAX, LCD_V_RES - 1);
    }

    if (LCD_TOUCH_MIRROR_X) {
      mapped_x = (LCD_H_RES - 1) - mapped_x;
    }
    if (LCD_TOUCH_MIRROR_Y) {
      mapped_y = (LCD_V_RES - 1) - mapped_y;
    }

    x[i] = mapped_x;
    y[i] = mapped_y;

    static int64_t s_last_log_us;
    int64_t now_us = esp_timer_get_time();
    if (now_us - s_last_log_us > 500000) {
      ESP_LOGI(TAG, "touch raw=(%u,%u) mapped=(%u,%u)", raw_x, raw_y, mapped_x, mapped_y);
      s_last_log_us = now_us;
    }
  }
}

static void async_show_home_page(void *arg)
{
  (void)arg;
  show_home_page();
}

static void async_show_wifi_page(void *arg)
{
  (void)arg;
  show_wifi_page();
}

static void async_show_wifi_connect_page(void *arg)
{
  (void)arg;
  show_wifi_connect_page(s_selected_ssid);
}

// LVGL is not thread-safe, so all LVGL object/timer calls share this mutex.
static void lvgl_lock(void)
{
  if (s_lvgl_mutex != NULL) {
    xSemaphoreTake(s_lvgl_mutex, portMAX_DELAY);
  }
}

static void lvgl_unlock(void)
{
  if (s_lvgl_mutex != NULL) {
    xSemaphoreGive(s_lvgl_mutex);
  }
}

// esp_lcd calls this after an asynchronous color transfer has finished.
static bool lcd_flush_ready_cb(esp_lcd_panel_io_handle_t panel_io,
                               esp_lcd_panel_io_event_data_t *edata,
                               void *user_ctx)
{
  (void)panel_io;
  (void)edata;

  lv_disp_drv_t *disp_drv = (lv_disp_drv_t *)user_ctx;
  lv_disp_flush_ready(disp_drv);

  return false;
}

static void lcd_flush_cb(lv_disp_drv_t *drv, const lv_area_t *area, lv_color_t *color_map)
{
  esp_lcd_panel_handle_t panel_handle = (esp_lcd_panel_handle_t)drv->user_data;
  // LVGL uses inclusive coordinates; esp_lcd expects the end coordinate to be exclusive.
  int x_start = area->x1;
  int x_end = area->x2 + 1;
  int y_start = area->y1;
  int y_end = area->y2 + 1;

  esp_lcd_panel_draw_bitmap(panel_handle, x_start, y_start, x_end, y_end, color_map);
}

static void lvgl_tick_cb(void *arg)
{
  (void)arg;
  // Keep LVGL's internal time base moving independently of the main task.
  lv_tick_inc(2);
}

static lv_obj_t *create_label(lv_obj_t *parent, const char *text, const lv_font_t *font)
{
  lv_obj_t *label = lv_label_create(parent);
  if (label != NULL) {
    lv_obj_set_style_text_font(label, font, 0);
    lv_obj_set_style_text_color(label, lv_color_hex(0x1f2937), 0);
    lv_label_set_text(label, text != NULL ? text : "");
  }
  return label;
}

