WheelerLee/esp32-ai-agent/components/LCD/lcd.c
static lv_obj_t *create_button(lv_obj_t *parent,
                               const char *text,
                               lv_coord_t width,
                               lv_coord_t height,
                               lv_event_cb_t cb,
                               void *user_data)
{
  lv_obj_t *button = lv_btn_create(parent);
  if (button == NULL) {
    return NULL;
  }

  lv_obj_set_size(button, width, height);
  lv_obj_set_style_radius(button, 6, 0);
  lv_obj_set_style_bg_color(button, lv_color_hex(0x2563eb), 0);
  lv_obj_set_style_bg_color(button, lv_color_hex(0x1d4ed8), LV_STATE_PRESSED);
  if (cb != NULL) {
    lv_obj_add_event_cb(button, cb, LV_EVENT_CLICKED, user_data);
  }

  lv_obj_t *label = create_label(button, text, ui_font());
  if (label != NULL) {
    lv_obj_set_style_text_color(label, lv_color_white(), 0);
    lv_obj_center(label);
  }

  return button;
}

static lv_obj_t *create_list_row(lv_obj_t *parent,
                                 const char *text,
                                 lv_coord_t width,
                                 lv_coord_t height,
                                 lv_event_cb_t cb,
                                 void *user_data)
{
  lv_obj_t *row = lv_obj_create(parent);
  if (row == NULL) {
    return NULL;
  }

  lv_obj_set_size(row, width, height);
  lv_obj_clear_flag(row, LV_OBJ_FLAG_SCROLLABLE);
  lv_obj_add_flag(row, LV_OBJ_FLAG_CLICKABLE | LV_OBJ_FLAG_EVENT_BUBBLE | LV_OBJ_FLAG_SCROLL_CHAIN_VER);
  lv_obj_set_style_radius(row, 6, 0);
  lv_obj_set_style_border_width(row, 1, 0);
  lv_obj_set_style_border_color(row, lv_color_hex(0xcbd5e1), 0);
  lv_obj_set_style_bg_color(row, lv_color_hex(0xffffff), 0);
  lv_obj_set_style_bg_color(row, lv_color_hex(0xe0f2fe), LV_STATE_PRESSED);
  lv_obj_set_style_pad_left(row, 8, 0);
  lv_obj_set_style_pad_right(row, 8, 0);
  if (cb != NULL) {
    lv_obj_add_event_cb(row, cb, LV_EVENT_CLICKED, user_data);
  }

  lv_obj_t *label = create_label(row, text, ui_font());
  if (label != NULL) {
    lv_obj_set_width(label, width - 16);
    lv_label_set_long_mode(label, LV_LABEL_LONG_DOT);
    lv_obj_align(label, LV_ALIGN_LEFT_MID, 0, 0);
  }

  return row;
}

static void clear_screen(void)
{
  lv_obj_clean(lv_scr_act());
  lv_obj_set_style_bg_color(lv_scr_act(), lv_color_hex(0xf8fafc), 0);
  lv_obj_set_style_bg_opa(lv_scr_act(), LV_OPA_COVER, 0);
}

static void home_wifi_event_cb(lv_event_t *event)
{
  if (lv_event_get_code(event) == LV_EVENT_CLICKED) {
    lv_async_call(async_show_wifi_page, NULL);
  }
}

static void play_task(void *arg)
{
  const char *url = (const char *)arg;
  esp_err_t err = audio_play_test_tone();
  if (err != ESP_OK) {
    ESP_LOGE(TAG, "play I2S test tone failed: %s", esp_err_to_name(err));
  }
  vTaskDelay(pdMS_TO_TICKS(250));

  err = audio_play_mp3_url(url);
  if (err != ESP_OK) {
    ESP_LOGE(TAG, "play %s failed: %s", url, esp_err_to_name(err));
  }
  vTaskDelete(NULL);
}

static void home_play_event_cb(lv_event_t *event)
{
  if (lv_event_get_code(event) != LV_EVENT_CLICKED) {
    return;
  }

  BaseType_t ret = xTaskCreate(play_task, "audio_play", 8192, (void *)LCD_PLAY_URL, 5, NULL);
  if (ret != pdPASS) {
    ESP_LOGE(TAG, "create audio play task failed");
  }
}

static void home_volume_down_event_cb(lv_event_t *event)
{
  if (lv_event_get_code(event) == LV_EVENT_CLICKED) {
    audio_volume_down();
  }
}

static void home_volume_up_event_cb(lv_event_t *event)
{
  if (lv_event_get_code(event) == LV_EVENT_CLICKED) {
    audio_volume_up();
  }
}

static void wifi_back_event_cb(lv_event_t *event)
{
  if (lv_event_get_code(event) == LV_EVENT_CLICKED) {
    lv_async_call(async_show_home_page, NULL);
  }
}

static void wifi_refresh_event_cb(lv_event_t *event)
{
  if (lv_event_get_code(event) == LV_EVENT_CLICKED) {
    lv_async_call(async_show_wifi_page, NULL);
  }
}

static void connect_back_event_cb(lv_event_t *event)
{
  if (lv_event_get_code(event) == LV_EVENT_CLICKED) {
    lv_async_call(async_show_wifi_page, NULL);
  }
}

static void wifi_scan_event_cb(lv_event_t *event)
{
  if (lv_event_get_code(event) == LV_EVENT_CLICKED) {
    start_wifi_scan();
  }
}

static void close_keyboard(void)
{
  if (s_keyboard != NULL) {
    lv_obj_del(s_keyboard);
    s_keyboard = NULL;
  }
}

static void textarea_event_cb(lv_event_t *event)
{
  if (lv_event_get_code(event) != LV_EVENT_FOCUSED || s_password_ta == NULL) {
    return;
  }

  close_keyboard();
  s_keyboard = lv_keyboard_create(lv_scr_act());
  if (s_keyboard != NULL) {
    lv_obj_set_size(s_keyboard, LCD_H_RES, 96);
    lv_obj_align(s_keyboard, LV_ALIGN_BOTTOM_MID, 0, 0);
    lv_keyboard_set_textarea(s_keyboard, s_password_ta);
  }
}

static void connect_task(void *arg)
{
  char password[65] = {0};
  if (arg != NULL) {
    strlcpy(password, (const char *)arg, sizeof(password));
  }

  esp_err_t err = app_wifi_connect(s_selected_ssid, password);
  if (err != ESP_OK) {
    ESP_LOGE(TAG, "connect to %s failed: %s", s_selected_ssid, esp_err_to_name(err));
  }

  for (int i = 0; i < 20; ++i) {
    lvgl_lock();
    update_wifi_status_text();
    lvgl_unlock();

    app_wifi_status_t status = {0};
    app_wifi_get_status(&status);
    if (status.connected || (!status.connecting && i > 1)) {
      break;
    }
    vTaskDelay(pdMS_TO_TICKS(500));
  }

  lvgl_lock();
  show_wifi_page();
  lvgl_unlock();
  vTaskDelete(NULL);
}

static void connect_event_cb(lv_event_t *event)
{
  if (lv_event_get_code(event) != LV_EVENT_CLICKED || s_password_ta == NULL) {
    return;
  }

  const char *password = lv_textarea_get_text(s_password_ta);
  static char s_password[65];
  strlcpy(s_password, password != NULL ? password : "", sizeof(s_password));
  close_keyboard();
  update_wifi_status_text();

  BaseType_t ret = xTaskCreate(connect_task, "wifi_connect", 4096, s_password, 4, NULL);
  if (ret != pdPASS) {
    ESP_LOGE(TAG, "create WiFi connect task failed");
  }
}

static void ssid_event_cb(lv_event_t *event)
{
  if (lv_event_get_code(event) != LV_EVENT_CLICKED) {
    return;
  }

  const char *ssid = (const char *)lv_event_get_user_data(event);
  if (ssid == NULL || ssid[0] == '\0') {
    return;
  }

  strlcpy(s_selected_ssid, ssid, sizeof(s_selected_ssid));
  lv_async_call(async_show_wifi_connect_page, NULL);
}

static void update_wifi_status_text(void)
{
  if (s_wifi_status_label == NULL) {
    return;
  }

  app_wifi_status_t status = {0};
  app_wifi_get_status(&status);

  char text[160];
  if (status.connected) {
    snprintf(text,
             sizeof(text),
             "已连接\n网络: %s\nIP: " IPSTR "\n网关: " IPSTR,
             status.ssid,
             IP2STR(&status.ip_info.ip),
             IP2STR(&status.ip_info.gw));
  } else if (status.connecting) {
    snprintf(text, sizeof(text), "正在连接\n网络: %s", status.ssid);
  } else {
    snprintf(text, sizeof(text), "未连接\n请扫描并选择 WiFi");
  }

  lv_label_set_text(s_wifi_status_label, text);
}

static void show_scan_results_locked(void)
{
  if (s_wifi_list == NULL) {
    return;
  }

