WheelerLee/esp32-ai-agent/components/LCD/lcd.c
  lv_obj_clean(s_wifi_list);
  if (s_scan_count == 0) {
    create_label(s_wifi_list, "未发现 WiFi", ui_font());
    return;
  }

  for (size_t i = 0; i < s_scan_count; ++i) {
    char row_text[64];
    snprintf(row_text,
             sizeof(row_text),
             "%s  %d dBm",
             s_scan_results[i].ssid[0] != '\0' ? s_scan_results[i].ssid : "<隐藏>",
             s_scan_results[i].rssi);
    lv_obj_t *row = create_list_row(s_wifi_list,
                                    row_text,
                                    LCD_H_RES - 32,
                                    34,
                                    ssid_event_cb,
                                    s_scan_results[i].ssid);
    if (row != NULL) {
      lv_obj_set_scroll_dir(row, LV_DIR_VER);
    }
  }
}

static void scan_task(void *arg)
{
  (void)arg;

  size_t count = 0;
  esp_err_t err = app_wifi_scan(s_scan_results, APP_WIFI_MAX_APS, &count);
  if (err != ESP_OK) {
    ESP_LOGE(TAG, "scan WiFi failed: %s", esp_err_to_name(err));
    count = 0;
  }

  lvgl_lock();
  s_scan_count = count;
  update_wifi_status_text();
  show_scan_results_locked();
  lvgl_unlock();

  vTaskDelete(NULL);
}

static void start_wifi_scan(void)
{
  close_keyboard();
  s_password_ta = NULL;
  s_scan_count = 0;

  if (s_wifi_list != NULL) {
    lv_obj_clean(s_wifi_list);
    create_label(s_wifi_list, "正在扫描...", ui_font());
  }

  BaseType_t ret = xTaskCreate(scan_task, "wifi_scan", 4096, NULL, 4, NULL);
  if (ret != pdPASS) {
    ESP_LOGE(TAG, "create WiFi scan task failed");
  }
}

static void show_home_page(void)
{
  close_keyboard();
  s_wifi_status_label = NULL;
  s_wifi_list = NULL;
  s_password_ta = NULL;

  clear_screen();

  lv_obj_t *title = create_label(lv_scr_act(), "ESP32 智能助手", ui_font());
  if (title != NULL) {
    lv_obj_align(title, LV_ALIGN_TOP_MID, 0, 36);
  }

  lv_obj_t *wifi_button = create_button(lv_scr_act(), "WiFi", 180, 58, home_wifi_event_cb, NULL);
  if (wifi_button != NULL) {
    lv_obj_align(wifi_button, LV_ALIGN_CENTER, 0, -18);
  }

  lv_obj_t *volume_down_button = create_button(lv_scr_act(), "音量-", 58, 58, home_volume_down_event_cb, NULL);
  if (volume_down_button != NULL) {
    lv_obj_align(volume_down_button, LV_ALIGN_CENTER, -96, 52);
  }

  lv_obj_t *play_button = create_button(lv_scr_act(), "播放", 104, 58, home_play_event_cb, NULL);
  if (play_button != NULL) {
    lv_obj_align(play_button, LV_ALIGN_CENTER, 0, 52);
  }

  lv_obj_t *volume_up_button = create_button(lv_scr_act(), "音量+", 58, 58, home_volume_up_event_cb, NULL);
  if (volume_up_button != NULL) {
    lv_obj_align(volume_up_button, LV_ALIGN_CENTER, 96, 52);
  }
}

static void show_wifi_connect_page(const char *ssid)
{
  close_keyboard();
  s_wifi_status_label = NULL;
  s_wifi_list = NULL;
  s_password_ta = NULL;

  clear_screen();

  lv_obj_t *header = lv_obj_create(lv_scr_act());
  if (header != NULL) {
    lv_obj_set_size(header, LCD_H_RES, 42);
    lv_obj_align(header, LV_ALIGN_TOP_MID, 0, 0);
    lv_obj_set_style_border_width(header, 0, 0);
    lv_obj_set_style_radius(header, 0, 0);
    lv_obj_set_style_bg_color(header, lv_color_hex(0xe2e8f0), 0);
    lv_obj_clear_flag(header, LV_OBJ_FLAG_SCROLLABLE);

    lv_obj_t *back = create_button(header, "返回", 72, 30, connect_back_event_cb, NULL);
    if (back != NULL) {
      lv_obj_align(back, LV_ALIGN_LEFT_MID, 4, 0);
    }

    lv_obj_t *title = create_label(header, "连接 WiFi", ui_font());
    if (title != NULL) {
      lv_obj_align(title, LV_ALIGN_CENTER, 0, 0);
    }
  }

  char ssid_text[64];
  snprintf(ssid_text, sizeof(ssid_text), "SSID: %s", ssid != NULL ? ssid : "");
  lv_obj_t *ssid_label = create_label(lv_scr_act(), ssid_text, ui_font());
  if (ssid_label != NULL) {
    lv_obj_set_width(ssid_label, LCD_H_RES - 24);
    lv_label_set_long_mode(ssid_label, LV_LABEL_LONG_DOT);
    lv_obj_align(ssid_label, LV_ALIGN_TOP_LEFT, 12, 52);
  }

  s_password_ta = lv_textarea_create(lv_scr_act());
  if (s_password_ta != NULL) {
    lv_obj_set_size(s_password_ta, LCD_H_RES - 24, 38);
    lv_obj_align(s_password_ta, LV_ALIGN_TOP_MID, 0, 78);
    lv_textarea_set_one_line(s_password_ta, true);
    lv_textarea_set_password_mode(s_password_ta, false);
    lv_textarea_set_placeholder_text(s_password_ta, "请输入密码");
    lv_obj_add_event_cb(s_password_ta, textarea_event_cb, LV_EVENT_FOCUSED, NULL);
    lv_obj_add_state(s_password_ta, LV_STATE_FOCUSED);
  }

  lv_obj_t *connect = create_button(lv_scr_act(), "连接", LCD_H_RES - 24, 34, connect_event_cb, NULL);
  if (connect != NULL) {
    lv_obj_align(connect, LV_ALIGN_TOP_MID, 0, 122);
  }

  if (s_password_ta != NULL) {
    s_keyboard = lv_keyboard_create(lv_scr_act());
    if (s_keyboard != NULL) {
      lv_obj_set_size(s_keyboard, LCD_H_RES, 78);
      lv_obj_align(s_keyboard, LV_ALIGN_BOTTOM_MID, 0, 0);
      lv_keyboard_set_textarea(s_keyboard, s_password_ta);
    }
  }
}

static void show_wifi_page(void)
{
  close_keyboard();
  s_password_ta = NULL;
  clear_screen();

  lv_obj_t *header = lv_obj_create(lv_scr_act());
  if (header != NULL) {
    lv_obj_set_size(header, LCD_H_RES, 42);
    lv_obj_align(header, LV_ALIGN_TOP_MID, 0, 0);
    lv_obj_set_style_border_width(header, 0, 0);
    lv_obj_set_style_radius(header, 0, 0);
    lv_obj_set_style_bg_color(header, lv_color_hex(0xe2e8f0), 0);
    lv_obj_clear_flag(header, LV_OBJ_FLAG_SCROLLABLE);

    lv_obj_t *back = create_button(header, "返回", 72, 30, wifi_back_event_cb, NULL);
    if (back != NULL) {
      lv_obj_align(back, LV_ALIGN_LEFT_MID, 4, 0);
    }

    lv_obj_t *title = create_label(header, "WiFi", ui_font());
    if (title != NULL) {
      lv_obj_align(title, LV_ALIGN_CENTER, 0, 0);
    }

    lv_obj_t *refresh = create_button(header, "刷新", 86, 30, wifi_refresh_event_cb, NULL);
    if (refresh != NULL) {
      lv_obj_align(refresh, LV_ALIGN_RIGHT_MID, -4, 0);
    }
  }

  s_wifi_status_label = create_label(lv_scr_act(), "", ui_font());
  if (s_wifi_status_label != NULL) {
    lv_obj_set_width(s_wifi_status_label, LCD_H_RES - 24);
    lv_label_set_long_mode(s_wifi_status_label, LV_LABEL_LONG_WRAP);
    lv_obj_align(s_wifi_status_label, LV_ALIGN_TOP_LEFT, 12, 52);
  }
  update_wifi_status_text();

  s_wifi_list = lv_obj_create(lv_scr_act());
  if (s_wifi_list != NULL) {
    lv_obj_set_size(s_wifi_list, LCD_H_RES - 16, 108);
    lv_obj_align(s_wifi_list, LV_ALIGN_BOTTOM_MID, 0, -8);
    lv_obj_set_flex_flow(s_wifi_list, LV_FLEX_FLOW_COLUMN);
    lv_obj_set_style_pad_all(s_wifi_list, 6, 0);
    lv_obj_set_style_pad_row(s_wifi_list, 6, 0);
    lv_obj_set_style_radius(s_wifi_list, 6, 0);
    lv_obj_set_style_bg_color(s_wifi_list, lv_color_white(), 0);
    lv_obj_set_style_border_color(s_wifi_list, lv_color_hex(0xcbd5e1), 0);
    lv_obj_set_scroll_dir(s_wifi_list, LV_DIR_VER);
    lv_obj_set_scrollbar_mode(s_wifi_list, LV_SCROLLBAR_MODE_AUTO);
  }

  app_wifi_status_t status = {0};
  app_wifi_get_status(&status);
  if (status.connected || status.connecting) {
    if (s_wifi_list != NULL) {
      create_button(s_wifi_list, "重新扫描", LCD_H_RES - 32, 36, wifi_scan_event_cb, NULL);
    }
  } else {
    start_wifi_scan();
  }
}

static void touch_read_cb(lv_indev_drv_t *drv, lv_indev_data_t *data)
{
  esp_lcd_touch_handle_t touch_handle = (esp_lcd_touch_handle_t)drv->user_data;
  uint16_t x[1];
  uint16_t y[1];
  uint16_t strength[1];
  uint8_t count = 0;

  data->state = LV_INDEV_STATE_REL;
  data->continue_reading = false;

  if (touch_handle == NULL || esp_lcd_touch_read_data(touch_handle) != ESP_OK) {
    return;
  }

  if (esp_lcd_touch_get_coordinates(touch_handle, x, y, strength, &count, 1) && count > 0) {
    data->point.x = x[0];
    data->point.y = y[0];
    data->state = LV_INDEV_STATE_PR;
  }
}

static void lvgl_task(void *arg)
{
  (void)arg;

  while (1) {
    lvgl_lock();
    uint32_t task_delay_ms = lv_timer_handler();
    lvgl_unlock();
    if (task_delay_ms > 20) {
      task_delay_ms = 20;
    }
    if (task_delay_ms < 5) {
      task_delay_ms = 5;
    }
    vTaskDelay(pdMS_TO_TICKS(task_delay_ms));
  }
}

static esp_err_t lcd_backlight_init(void)
{
  // Keep the backlight off until the panel is initialized to avoid visible noise.
  gpio_config_t bk_gpio_config = {
    .mode = GPIO_MODE_OUTPUT,
    .pin_bit_mask = 1ULL << LCD_PIN_NUM_BK_LIGHT,
  };
  ESP_RETURN_ON_ERROR(gpio_config(&bk_gpio_config), TAG, "configure backlight GPIO failed");
  ESP_RETURN_ON_ERROR(gpio_set_level(LCD_PIN_NUM_BK_LIGHT, LCD_BK_LIGHT_OFF_LEVEL),
                      TAG,
                      "turn backlight off failed");
  return ESP_OK;
}

static esp_err_t lcd_panel_init(void)
{
  // Configure SPI2 on ESP32-S3 native IO_MUX pins for the display bus.
  spi_bus_config_t bus_config = {
    .sclk_io_num = LCD_PIN_NUM_SCLK,
    .mosi_io_num = LCD_PIN_NUM_MOSI,
    .miso_io_num = LCD_PIN_NUM_MISO,
    .quadwp_io_num = GPIO_NUM_NC,
    .quadhd_io_num = GPIO_NUM_NC,
    .max_transfer_sz = LCD_H_RES * LCD_DRAW_BUF_LINES * sizeof(lv_color_t),
  };
  ESP_RETURN_ON_ERROR(spi_bus_initialize(LCD_SPI_HOST, &bus_config, SPI_DMA_CH_AUTO),
                      TAG,
                      "initialize SPI bus failed");

  // Panel IO translates esp_lcd commands and pixel transfers to SPI transactions.
  esp_lcd_panel_io_handle_t io_handle = NULL;
  esp_lcd_panel_io_spi_config_t io_config = {
    .dc_gpio_num = LCD_PIN_NUM_DC,
    .cs_gpio_num = LCD_PIN_NUM_CS,
    .pclk_hz = LCD_PIXEL_CLOCK_HZ,
    .lcd_cmd_bits = 8,
    .lcd_param_bits = 8,
    .spi_mode = 0,
    .trans_queue_depth = 10,
    .on_color_trans_done = lcd_flush_ready_cb,
    .user_ctx = &s_disp_drv,
  };
  ESP_RETURN_ON_ERROR(esp_lcd_new_panel_io_spi((esp_lcd_spi_bus_handle_t)LCD_SPI_HOST,
                                               &io_config,
                                               &io_handle),
                      TAG,
                      "create LCD panel IO failed");

  // Most 2.8 inch ILI9341 modules use BGR order; switch here if colors are wrong.
  esp_lcd_panel_dev_config_t panel_config = {
    .reset_gpio_num = LCD_PIN_NUM_RST,
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 2, 0)
    .rgb_ele_order = LCD_RGB_ELEMENT_ORDER_BGR,
#else
    .color_space = ESP_LCD_COLOR_SPACE_BGR,
#endif
    .bits_per_pixel = 16,
  };
  ESP_RETURN_ON_ERROR(esp_lcd_new_panel_ili9341(io_handle, &panel_config, &s_panel_handle),
                      TAG,
                      "create ILI9341 panel failed");

  ESP_RETURN_ON_ERROR(esp_lcd_panel_reset(s_panel_handle), TAG, "reset panel failed");
  ESP_RETURN_ON_ERROR(esp_lcd_panel_init(s_panel_handle), TAG, "init panel failed");
  // Rotate the physical 240x320 panel into landscape 320x240.
  ESP_RETURN_ON_ERROR(esp_lcd_panel_swap_xy(s_panel_handle, LCD_SWAP_XY), TAG, "swap xy failed");
  ESP_RETURN_ON_ERROR(esp_lcd_panel_mirror(s_panel_handle, LCD_MIRROR_X, LCD_MIRROR_Y),
                      TAG,
                      "mirror panel failed");
  ESP_RETURN_ON_ERROR(esp_lcd_panel_disp_on_off(s_panel_handle, true), TAG, "turn display on failed");
  ESP_RETURN_ON_ERROR(gpio_set_level(LCD_PIN_NUM_BK_LIGHT, LCD_BK_LIGHT_ON_LEVEL),
                      TAG,
                      "turn backlight on failed");

  return ESP_OK;
}

static esp_err_t touch_init(void)
{
  esp_lcd_panel_io_handle_t touch_io_handle = NULL;
  esp_lcd_panel_io_spi_config_t touch_io_config =
    ESP_LCD_TOUCH_IO_SPI_XPT2046_CONFIG(LCD_PIN_NUM_TOUCH_CS);

  ESP_RETURN_ON_ERROR(esp_lcd_new_panel_io_spi((esp_lcd_spi_bus_handle_t)LCD_SPI_HOST,
                                               &touch_io_config,
                                               &touch_io_handle),
                      TAG,
                      "create touch panel IO failed");

  esp_lcd_touch_config_t touch_config = {
    .x_max = LCD_H_RES,
    .y_max = LCD_V_RES,
    .rst_gpio_num = GPIO_NUM_NC,
    .int_gpio_num = LCD_PIN_NUM_TOUCH_IRQ,
    .flags = {
      .swap_xy = false,
      .mirror_x = false,
      .mirror_y = false,
    },
    .process_coordinates = touch_process_coordinates,
  };

  ESP_LOGI(TAG, "initialize XPT2046 touch controller");
  ESP_RETURN_ON_ERROR(esp_lcd_touch_new_spi_xpt2046(touch_io_handle,
                                                    &touch_config,
                                                    &s_touch_handle),
                      TAG,
                      "initialize XPT2046 failed");

